trekon-bench/output.txt
Getting JWT token...
Token: null

Testing GET /user
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/user/67fe102c37c7092de433cbd2
Document Length:        0 bytes

Concurrency Level:      10
Time taken for tests:   0.898 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      26200 bytes
HTML transferred:       0 bytes
Requests per second:    111.34 [#/sec] (mean)
Time per request:       89.814 [ms] (mean)
Time per request:       8.981 [ms] (mean, across all concurrent requests)
Transfer rate:          28.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:    33   46  65.9     36     505
Waiting:       33   46  65.9     36     505
Total:         33   47  65.9     36     505

Percentage of the requests served within a certain time (ms)
  50%     36
  66%     38
  75%     41
  80%     42
  90%     43
  95%     45
  98%    505
  99%    505
 100%    505 (longest request)
Testing POST /checkHabit
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/user/67fe102c37c7092de433cbd2/checkHabit
Document Length:        26 bytes

Concurrency Level:      10
Time taken for tests:   0.978 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      30100 bytes
Total body sent:        25000
HTML transferred:       2600 bytes
Requests per second:    102.20 [#/sec] (mean)
Time per request:       97.846 [ms] (mean)
Time per request:       9.785 [ms] (mean, across all concurrent requests)
Transfer rate:          30.04 [Kbytes/sec] received
                        24.95 kb/s sent
                        54.99 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:    34   45  52.1     38     557
Waiting:       33   45  52.1     38     557
Total:         34   45  52.1     38     557

Percentage of the requests served within a certain time (ms)
  50%     38
  66%     42
  75%     43
  80%     43
  90%     48
  95%     56
  98%     58
  99%    557
 100%    557 (longest request)
Testing POST /checkWorkout
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/user/67fe102c37c7092de433cbd2/checkWorkout
Document Length:        26 bytes

Concurrency Level:      10
Time taken for tests:   0.529 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      30100 bytes
Total body sent:        23100
HTML transferred:       2600 bytes
Requests per second:    189.20 [#/sec] (mean)
Time per request:       52.853 [ms] (mean)
Time per request:       5.285 [ms] (mean, across all concurrent requests)
Transfer rate:          55.62 [Kbytes/sec] received
                        42.68 kb/s sent
                        98.30 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:    33   46  16.7     41     107
Waiting:       33   45  15.5     41     102
Total:         34   46  16.6     41     107

Percentage of the requests served within a certain time (ms)
  50%     41
  66%     44
  75%     47
  80%     53
  90%     64
  95%    100
  98%    102
  99%    107
 100%    107 (longest request)
Testing GET /user/:id/habit
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/user/67fe102c37c7092de433cbd2/habit
Document Length:        0 bytes

Concurrency Level:      10
Time taken for tests:   0.837 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      26200 bytes
HTML transferred:       0 bytes
Requests per second:    119.42 [#/sec] (mean)
Time per request:       83.738 [ms] (mean)
Time per request:       8.374 [ms] (mean, across all concurrent requests)
Transfer rate:          30.55 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:    34   42  40.0     37     436
Waiting:       33   42  39.9     37     436
Total:         34   42  40.0     37     436

Percentage of the requests served within a certain time (ms)
  50%     37
  66%     39
  75%     41
  80%     42
  90%     45
  95%     47
  98%     48
  99%    436
 100%    436 (longest request)
Testing GET /user/:id/workout
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/user/67fe102c37c7092de433cbd2/workout
Document Length:        0 bytes

Concurrency Level:      10
Time taken for tests:   0.963 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      26200 bytes
HTML transferred:       0 bytes
Requests per second:    103.85 [#/sec] (mean)
Time per request:       96.294 [ms] (mean)
Time per request:       9.629 [ms] (mean, across all concurrent requests)
Transfer rate:          26.57 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:    34   90 154.4     38     551
Waiting:       33   89 154.2     38     550
Total:         34   90 154.4     38     551

Percentage of the requests served within a certain time (ms)
  50%     38
  66%     42
  75%     43
  80%     44
  90%    550
  95%    551
  98%    551
  99%    551
 100%    551 (longest request)
Testing POST /user/:id/habit
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/user/67fe102c37c7092de433cbd2/habit
Document Length:        26 bytes

Concurrency Level:      10
Time taken for tests:   0.996 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      30100 bytes
Total body sent:        24500
HTML transferred:       2600 bytes
Requests per second:    100.43 [#/sec] (mean)
Time per request:       99.567 [ms] (mean)
Time per request:       9.957 [ms] (mean, across all concurrent requests)
Transfer rate:          29.52 [Kbytes/sec] received
                        24.03 kb/s sent
                        53.55 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:    34   94 157.2     40     579
Waiting:       34   94 157.1     40     579
Total:         34   95 157.3     40     579

Percentage of the requests served within a certain time (ms)
  50%     40
  66%     43
  75%     48
  80%     61
  90%    538
  95%    579
  98%    579
  99%    579
 100%    579 (longest request)
Testing POST /user/:id/workout
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/user/67fe102c37c7092de433cbd2/workout
Document Length:        26 bytes

Concurrency Level:      10
Time taken for tests:   0.931 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      30100 bytes
Total body sent:        22600
HTML transferred:       2600 bytes
Requests per second:    107.40 [#/sec] (mean)
Time per request:       93.108 [ms] (mean)
Time per request:       9.311 [ms] (mean, across all concurrent requests)
Transfer rate:          31.57 [Kbytes/sec] received
                        23.70 kb/s sent
                        55.27 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:    33   87 146.4     38     559
Waiting:       33   87 146.3     38     559
Total:         33   87 146.4     38     560

Percentage of the requests served within a certain time (ms)
  50%     38
  66%     40
  75%     44
  80%     44
  90%    514
  95%    521
  98%    522
  99%    560
 100%    560 (longest request)
Testing GET /habit
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/habit
Document Length:        19286 bytes

Concurrency Level:      10
Time taken for tests:   2.153 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      1939100 bytes
HTML transferred:       1928600 bytes
Requests per second:    46.45 [#/sec] (mean)
Time per request:       215.280 [ms] (mean)
Time per request:       21.528 [ms] (mean, across all concurrent requests)
Transfer rate:          879.62 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:    74  194 194.2    106     772
Waiting:       74  194 194.2    106     771
Total:         74  194 194.3    106     772

Percentage of the requests served within a certain time (ms)
  50%    106
  66%    116
  75%    130
  80%    456
  90%    576
  95%    579
  98%    696
  99%    772
 100%    772 (longest request)
Testing POST /habit
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/habit
Document Length:        63 bytes

Concurrency Level:      10
Time taken for tests:   1.632 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      16800 bytes
Total body sent:        20800
HTML transferred:       6300 bytes
Requests per second:    61.26 [#/sec] (mean)
Time per request:       163.240 [ms] (mean)
Time per request:       16.324 [ms] (mean, across all concurrent requests)
Transfer rate:          10.05 [Kbytes/sec] received
                        12.44 kb/s sent
                        22.49 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:    37  156 248.4     43     837
Waiting:       37  156 248.3     42     837
Total:         37  156 248.4     43     837

Percentage of the requests served within a certain time (ms)
  50%     43
  66%     46
  75%     49
  80%    370
  90%    801
  95%    835
  98%    835
  99%    837
 100%    837 (longest request)
ALL FUNCTIONAL ENDPOINTS TESTED